views/class-students/_form.php


    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'class_id')->dropDownList(
          ArrayHelper::map(Classes::find()->all(), 'class_id', 'class_name'),
          ['prompt' => 'Select Class']
    ) ?>

    <?= $form->field($model, 'student_id')->dropDownList(
          ArrayHelper::map(Students::find()->all(), 'student_id', 'student_no'),
          ['prompt' => 'Select Student']
    ) ?>
---
SELECT * FROM `classes`
SELECT * FROM `students`