controllers/ClassStudentsController.php

INSERT INTO `class_students` (`class_id`, `student_id`) VALUES (1, 1)
SELECT EXISTS(SELECT * FROM `students` WHERE `students`.`student_id`='1')
---
    public function actionCreate()
    {
        $model = new ClassStudents();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {

SELECT * FROM `class_students` WHERE `class_student_id`='2'
---
    protected function findModel($class_student_id)
    {
        if (($model = ClassStudents::findOne(['class_student_id' => $class_student_id])) !== null) {