controllers/ClassTeachersController.php

SELECT * FROM `class_teachers` WHERE `class_teacher_id`='2'
---
    protected function findModel($class_teacher_id)
    {
        if (($model = ClassTeachers::findOne(['class_teacher_id' => $class_teacher_id])) !== null) {